In [2]:
import pandas as pd
import numpy as np

**Types Of Duplicates :**

1)Exact Duplicates :

In [5]:
#Simple duplicate detection
df = pd.DataFrame({
    'Name':['John Smith', 'Jane Doe', 'John Smith', 'Jon Smith'],
    'Age':[25, 30, 25, 30],
    'City': ['New York', 'Boston', 'New York', 'New York']
})
print(df.duplicated().sum())

1

2)Partial Duplicates :

In [6]:
df = pd.DataFrame({
    'Name': ['John Doe', 'John Doe', 'Jane Smoth'],
    'Age': [25, 25, 30],
    'City': ['New York', 'Boston', 'Boston']
})
df

         Name  Age      City
0    John Doe   25  New York
1    John Doe   25    Boston
2  Jane Smoth   30    Boston

In [7]:
df.drop_duplicates(subset=['Name', 'Age'])

         Name  Age      City
0    John Doe   25  New York
2  Jane Smoth   30    Boston

3)Near-Duplicates(Fuzzy Duplicates) :

In [8]:
df = pd.DataFrame({
    'Name': ['John Smith', 'Jon Smyth'],
    'Age': [24, 24],
    'City': ['New York', 'NY']
})
df

         Name  Age      City
0  John Smith   24  New York
1   Jon Smyth   24        NY

In [9]:
df.drop_duplicates(subset=['Name', 'Age'])

         Name  Age      City
0  John Smith   24  New York
1   Jon Smyth   24        NY

4)Cross-Column Duplicates :

In [10]:
df = pd.DataFrame({
    'Full_name': ['John Smith','Jane Doe'],
    'First_name': ['John', 'Jane'],
    'Last_name': ['Smith', 'Doe']
    })
df

    Full_name First_name Last_name
0  John Smith       John     Smith
1    Jane Doe       Jane       Doe

In [11]:
df.drop_duplicates(subset=['Full_name'])

    Full_name First_name Last_name
0  John Smith       John     Smith
1    Jane Doe       Jane       Doe

**Identifying Duplicate Records :**

In [12]:
df = pd.DataFrame({
    'Name': ['John Doe', 'John Doe', 'Jane Smoth'],
    'Age': [25, 25, 30],
    'City': ['New York', 'Boston', 'Boston']
})

In [13]:
df[df.duplicated(subset=['Name', "Age"])]

       Name  Age    City
1  John Doe   25  Boston